<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"s3","backend":"24d25720175f4004d3708b9115c4580288578dbec3680fb19312fb23a19f9e04","plan_job_ref":"Job Infrastructure #318 at https://github.com/coverage-robot/core/actions/runs/7401153604","plan_hash":"4e49f75dcd5ed5807d53ded0cc9afdee71f6e06e2f8f9fc4b92809a07153a19a","plan_text_format":"diff","version":"1.39.0"} -->
Terraform plan in __./infrastructure__ in the __prod__ workspace
With var files: `./infrastructure/prod.tfvars`<details open><summary>With variables</summary>

```hcl
planetscale_service_token    = (sensitive value)
planetscale_service_token_id = (sensitive value)
```
</details>
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.warehouse.google_bigquery_table.coverage will be created
+   resource "google_bigquery_table" "coverage" {
+       clustering          = [
+           "uploadId",
+           "fileName",
        ]
+       creation_time       = (known after apply)
+       dataset_id          = "****"
+       deletion_protection = false
+       effective_labels    = (known after apply)
+       etag                = (known after apply)
+       expiration_time     = (known after apply)
+       id                  = (known after apply)
+       last_modified_time  = (known after apply)
+       location            = (known after apply)
+       num_bytes           = (known after apply)
+       num_long_term_bytes = (known after apply)
+       num_rows            = (known after apply)
+       project             = "coverage-384615"
+       schema              = jsonencode(
            [
+               {
+                   description = "The unique upload id for the uploaded file."
+                   mode        = "REQUIRED"
+                   name        = "uploadId"
+                   type        = "STRING"
                },
+               {
+                   description = "The commit hash which the coverage was generated for."
+                   mode        = "REQUIRED"
+                   name        = "commit"
+                   type        = "STRING"
                },
+               {
+                   description = "The parent commit hash(es) of the commit the coverage was generated for."
+                   mode        = "REPEATED"
+                   name        = "parent"
+                   type        = "STRING"
                },
+               {
+                   description = "The ref (e.g. branch) in the VCS provider."
+                   mode        = "REQUIRED"
+                   name        = "ref"
+                   type        = "STRING"
                },
+               {
+                   description = "The original format of the coverage file ingested."
+                   mode        = "REQUIRED"
+                   name        = "sourceFormat"
+                   type        = "STRING"
                },
+               {
+                   description = "The total number of lines ingested from the coverage file."
+                   mode        = "REQUIRED"
+                   name        = "totalLines"
+                   type        = "INTEGER"
                },
+               {
+                   description = "The path of the file which the line exists in."
+                   mode        = "REQUIRED"
+                   name        = "fileName"
+                   type        = "STRING"
                },
+               {
+                   description = "The number of the line."
+                   mode        = "REQUIRED"
+                   name        = "lineNumber"
+                   type        = "INTEGER"
                },
+               {
+                   description = "The type of the line coverage."
+                   mode        = "REQUIRED"
+                   name        = "type"
+                   type        = "STRING"
                },
+               {
+                   description = "The user provided tag of the coverage file."
+                   mode        = "REQUIRED"
+                   name        = "tag"
+                   type        = "STRING"
                },
+               {
+                   description = "The repository owner for the VCS provider."
+                   mode        = "REQUIRED"
+                   name        = "owner"
+                   type        = "STRING"
                },
+               {
+                   description = "The repository name for the VCS provider."
+                   mode        = "REQUIRED"
+                   name        = "repository"
+                   type        = "STRING"
                },
+               {
+                   description = "The VCS provider."
+                   mode        = "REQUIRED"
+                   name        = "provider"
+                   type        = "STRING"
                },
+               {
+                   description = "The lines metadata."
+                   fields      = [
+                       {
+                           mode = "REQUIRED"
+                           name = "key"
+                           type = "STRING"
                        },
+                       {
+                           mode = "NULLABLE"
+                           name = "value"
+                           type = "STRING"
                        },
                    ]
+                   mode        = "REPEATED"
+                   name        = "metadata"
+                   type        = "RECORD"
                },
+               {
+                   description = "The time the coverage was generated."
+                   mode        = "NULLABLE"
+                   name        = "generatedAt"
+                   type        = "DATETIME"
                },
+               {
+                   description = "The number of the line."
+                   mode        = "NULLABLE"
+                   name        = "ingestTime"
+                   type        = "DATETIME"
                },
            ]
        )
+       self_link           = (known after apply)
+       table_id            = "********"
+       terraform_labels    = (known after apply)
+       type                = (known after apply)

+       time_partitioning {
+           expiration_ms = (known after apply)
+           field         = "ingestTime"
+           type          = "DAY"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
!~  line_coverage_table       = {
        id                          = "projects/coverage-384615/datasets/prod/tables/line_coverage"
!~      last_modified_time          = 1703778827382 -> 1704307337360
!~      num_bytes                   = 1121973185693 -> 1179535761585
!~      num_rows                    = 2656122208 -> 2792606797
#        (27 unchanged attributes hidden)
    }
!~  upload_table              = {
        id                          = "projects/coverage-384615/datasets/prod/tables/upload"
!~      last_modified_time          = 1703775992362 -> 1704305282932
!~      num_bytes                   = 7787527 -> 8156367
!~      num_rows                    = 31915 -> 33441
#        (27 unchanged attributes hidden)
    }
```
</details>

:memo: Plan generated in [Infrastructure #318](https://github.com/coverage-robot/core/actions/runs/7401153604)